a=[1,2,3]
b=["g","j"]
s=a+b
print(s)
# [1, 2, 3, 'g', 'j']

print(a*5)
# [1, 2, 3, 1, 2, 3, 1, 2, 3, 1, 2, 3, 1, 2, 3]

x=[0]*10
print(x)
# [0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
x=[0.0]*10
print(x)
# [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0]

x=['a']*10
print(x)
# ['a', 'a', 'a', 'a', 'a', 'a', 'a', 'a', 'a', 'a']

x=[[0]*4]*2
print(x)
# [[0, 0, 0, 0], [0, 0, 0, 0]]

y=[6, 8, 3, 2]
# يعطي عدد العناصر الرقمية والنصية على حدة(غير مجتمعة)
print(len(y))
# 4
# يجمع العناصر الرقمية فقط
print(sum(y))
# 19


print(max(y))
# 8
print(min(y))
# 2

d=["s","a","c","x","z"]
print(max(d))
# z
print(min(d))
# a

# يرتب من الاصغر للاكبر بشكل مؤقت
print(sorted(y))
# [2, 3, 6, 8]
print(sorted(d))
# ['a', 'c', 's', 'x', 'z']
print(y)
# [6, 8, 3, 2]
print(d)
# ['s', 'a', 'c', 'x', 'z']

y.sort()
d.sort()
print(y)
# [2, 3, 6, 8]
print(d)
# ['a', 'c', 's', 'x', 'z']






















