y=[1,2,3,4,5]
# اضافة رقم للاخير
y.append(6)
print(y)
# [1, 2, 3, 4, 5, 6]

# اضافة عنصر بموقع معين
y.insert(2,2.5)
print(y)
# [1, 2, 2.5, 3, 4, 5, 6]


# الرقم تكرر كم مرة
print(y.count(2))
# 1

# # يعطي رقم العنصر
print(y.index(2.5))
# 2

# ترتيب عكسي
y.reverse()
print(y)
# [6, 5, 4, 3, 2.5, 2, 1]

# يجذف اخر عنصر
x=[1,2,3,4,5]
x.pop()
print(x)
# [1, 2, 3, 4]
# يحذف اخر عنصر من خلال رقمه
x.pop(0)
print(x)
# [2, 3, 4]

# يعطي بعد القائمة
a=range(5)
print(a)
# range(0, 5)
# البداية , النهاية ناقص واحد
b=list(range(1,6))
print(b)
# [1, 2, 3, 4, 5]

# البداية,النهاية ناقص واحد,عدد الخطوات
d=list(range(1,10,2))
print(d)
# [1, 3, 5, 7, 9]

































