# هنا يعمل ارقام عشوائية من 0 لـ 1 بالعدد المطلوب
from numpy import *
a=random.rand(10)
print(a)
# [0.2323804  0.10779157 0.48997481 0.66264053 0.02881879 0.21385445
 # 0.41369819 0.17325386 0.23270284 0.02282364]


# او مصفوفة بعدين
a=random.rand(1,2)
print(a)
# [[0.21501489 0.01898656]]

# او تلات ابعاد
a=random.rand(1,2,3)
print(a)
# [[[0.11285013 0.58383305 0.52786272]
  # [0.39915758 0.13832768 0.10951694]]]


# أمر choice   يختار قيمة عشوائية
a=[1,2,3,4,5,6,4,6,8]
print(random.choice(a))
# 5



# أمر shuffle  يعمل تغيير عشوائي في الترتيب
a=[1,2,3,4,5,6,4,6,8]
print(a)
# [1, 2, 3, 4, 5, 6, 4, 6, 8]
random.shuffle(a)
print(a)
# [1, 5, 8, 4, 6, 6, 3, 4, 2]


# عمل مصفوفة اصفار او  وحايد
a=zeros(8)
b=ones(3)
print(a)
# [0. 0. 0. 0. 0. 0. 0. 0.]
print(b)
# [1. 1. 1.]

# لو مطلوب بعدين (فيه قوسين في الاول وفي الاخر)
a=zeros((3,2))
print(a)
# [[0. 0.]
 # [0. 0.]
 # [0. 0.]]

# تلات ابعاد
b=ones((2,3,2))
print(b)
# [[[1. 1.]
  # [1. 1.]
  # [1. 1.]]

 # [[1. 1.]
  # [1. 1.]
  # [1. 1.]]]


# مصفوفةالوحدة ثنائية الابعاد
a=eye(3)
print(a)
# [[1. 0. 0.]
 # [0. 1. 0.]
 # [0. 0. 1.]]


# أمر full بيعمل مصفوفة بنفس الرقم المعطي
print(full((3,2),7))
# [[7 7]
 # [7 7]
 # [7 7]]
a = full((3, 2), 7)
print(a)
# [[7 7]
 # [7 7]
 # [7 7]]

# و ممكن كتابة مصفوفة بابعاد محددة
a=arange(6).reshape(3,2)
print(a)
# [[0 1]
 # [2 3]
 # [4 5]]
a=arange(12).reshape(2,3,2)
print(a)
# [[[ 0  1]
  # [ 2  3]
  # [ 4  5]]

 # [[ 6  7]
  # [ 8  9]
  # [10 11]]]


# لكتابة ارقام متوزعة بالتساوي بين رقمين
a=linspace(0,5)
print(a)
# يقسم الى 50 قسم بالتساوي
b=linspace(0,5,6)
print(b)
# [0. 1. 2. 3. 4. 5.]

# لتحويلها لمصفوفة
a=linspace(0,5,6).reshape(3,2)
b=linspace(0,5,6).reshape(1,3,2)
print(a)
# [[0. 1.]
 # [2. 3.]
 # [4. 5.]]
print(b)
# [[[0. 1.]
  # [2. 3.]
  # [4. 5.]]]


# المصفوفة القطرية
a=diag([5,12,6,-7])
print(a)
# [[ 5  0  0  0]
 # [ 0 12  0  0]
 # [ 0  0  6  0]
 # [ 0  0  0 -7]]
a=diag([5,12,6,-7],k=2)
print(a)
# [[ 0  0  5  0  0  0]
 # [ 0  0  0 12  0  0]
 # [ 0  0  0  0  6  0]
 # [ 0  0  0  0  0 -7]
 # [ 0  0  0  0  0  0]
 # [ 0  0  0  0  0  0]]



































































