L=(1,2,3,4,5)
print(L)
# (1, 2, 3, 4, 5)
# جميع خصائص القوائم تعمل ما عدا الحذف والتعديل
# تستخدم للبيانات الثابتة مثل اشهر السنة وايام الاسبوع الخ

# هنا يتم التعامل على انها قائمةlist
student_t=[('ahmad','a',23 ),('ali','b',20 ),('omar','c',30 )]
a=sorted(student_t,key=lambda s:s[2])
print(a)
# [('ali', 'b', 20), ('ahmad', 'a', 23), ('omar', 'c', 30)]

print(L[1])
# 2










































































